// Finals.ReturnArray.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

int* max_vect(int, int*, int*);

int main()
{
    int a[] = { 1,2,3,4,5,6,7,2 };
    int b[] = { 7,6,5,4,3,2,1,3 };

    int kc = sizeof(a) / sizeof(a[0]); //Количество элементов массива
    int* c; //Указатель на результирующий массив

    c = max_vect(kc, a, b); //вызов функции для создания массива

    for (int i = 0; i < kc; i++) //Вывод результата.
        std::cout << c[i] << " ";
    std::cout << std::endl;
    
    delete[]c;
}

int* max_vect(int k, int* a, int* b)
{
    int* c = new int[k];
    for (int i = 0; i < k; i++)
    {
        if (a[i] > b[i] || a[i] == b[i])
        {
            c[i] = a[i];
        }

        else c[i] = b[i];
    }

    return c;
}
// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
