// Final.TriangleAndDots.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include "Dot.h"
#include "Triangle.h"

int main()
{
    setlocale(LC_ALL, "rus");
    Dot first(1, 1);
    Dot second(5, 4);
    Dot third(3, -1);

    Triangle triangle(first, second, third);
    triangle.showEdgesLength();
    triangle.move();
    

    std::cout << first.get_x() << ":" << first.get_y() << std::endl;
    ++first;
    std::cout << first.get_x() << ":" << first.get_y() << std::endl;
    triangle.show_a();

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
